{
"lessons":[
    {
        "description":"Τα διαγράμματα κλάσεων περιγράφουν τις οντότητες που απαρτίζουν ένα σύστημα και τις στατικές συσχετίσεις μεταξύ τους. Αποτελούνται από: Κλάσεις (classes) και Σχέσεις (relationships).",
        "id":0,
        "name":"Κλάση, ιδιότητες και λειτουργίες",
        "image":"1.png",
        "image0":"",
        "image1":"",
        "image2":"chapter1_1.png",
        "image3":"",
        "image4":"",
        "image5":"",
        "image6":"",
        "image7":"",
        "image8":"",
        "image9":"",
        "image10":"",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"",
        "p0":"Το σύνολο των αντικειμένων που έχουν την ίδια δομή και την ίδια συμπεριφορά, ονομάζεται κλάση. Όλα τα αντικείμενα είναι στιγμιότυπα μιας κλάσης.",
        "p1":" Μια κλάση σχεδιάζεται ως ένα ορθογώνιο με τρία τμήματα. Το πρώτο τμήμα περιλαμβάνει το Όνομα της κλάσης, το δεύτερο τις ιδιότητες (attributes) και το τρίτο τις λειτουργίες (operations).",
        "p2":" Ιδιότητες κλάσης:",
        "p3":"- Μια κλάση μπορεί να έχει ή να μην έχει ιδιότητες.",
        "p4":"- Οι ιδιότητες είναι κοινές για όλα τα αντικείμενα της κλάσης.",
        "p5":"- Σε οποιαδήποτε χρονική στιγμή ένα αντικείμενο της κλάσης θα έχει συγκεκριμένες τιμές για κάθε μια ιδιότητα της κλάσης.",
        "p6":"- Οι ιδιότητες των κλάσεων προσδιορίζονται με τον ακόλουθο συμβολισμό: ορατότητα όνομα: τύπος = προκαθορισμένη_τιμή.",
        "p7":"Λειτουργίες κλάσης:",
        "p8":"Οι λειτουργίες περιγράφουν τι υπηρεσίες προσφέρει η κάθε κλάση και κάποιες από αυτές παρέχουν την κατάλληλη διασύνδεση με άλλες κλάσεις. Οι λειτουργίες των κλάσεων προσδιορίζονται με τον ακόλουθο συμβολισμό: ορατότητα όνομα (λίστα παραμέτρων):επιστρεφόμενος_τύπος. Μια κλάση μπορεί να έχει ή να μην έχει καθόλου λειτουργίες.",
        "p9":"Μία κλάση ορίζει την ορατότητα των ιδιοτήτων και των λειτουργιών της ως εξής:",
        "p10":" public (+) Ορατότητα σε όλο το σύστημα.",
        "p11":" private (-) Ορατότητα μόνο εντός της κλάσης.",
        "p12":" package (~) Ορατότητα μόνο στο πακέτο που περιέχει την κλάση.",
        "p13":"protected (#) Ορατότητα μόνο στην κλάση και τους απογόνους της.",
        "p14":""
    },
    {
        "description":"Οι συσχετίσεις αναφέρονται στις διασυνδέσεις βάσει των οποίων τα αντικείμενα διαφόρων κλάσεων μπορούν να αλληλεπιδρούν.",
        "id":1,
        "name":"Συσχέτιση",
        "image":"2.png",
        "image0":"",
        "image1":"",
        "image2":"",
        "image3":"",
        "image4":"",
        "image5":"chapter2_1.png",
        "image6":"",
        "image7":"",
        "image8":"",
        "image9":"",
        "image10":"",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"chapter2_2.png",
        "p0":"Μία συσχέτιση απεικονίζεται με μία συνεχή γραμμή που συνδέει τις κλάσεις που συμμετέχουν. ",
        "p1":"Χαρακτηρίζεται από:",
        "p2":" - Ένα όνομα (ρήμα), το οποίο φανερώνει το είδος της συσχέτισης και μπορεί να είναι διαφορετικό ανάλογα με τη φορά ανάγνωσης.",
        "p3":" - Το όνομα του ρόλου (ουσιαστικό) που παίζει κάθε μέρος στη συσχέτιση και το οποίο σημειώνεται στο τέλος της σχέσης, δηλαδή στο σημείο σύνδεσης με την κλάση.",
        "p4":" - Την πολλαπλότητα, η οποία υποδηλώνει τον αριθμό των στιγμιοτύπων μιας κλάσης που μπορούν να συσχετιστούν με ένα στιγμιότυπο μιας άλλης κλάσης και δηλώνεται από έναν αριθμό ή μια περιοχή αριθμών πάνω από την αντίστοιχη άκρη της γραμμής.",
        "p5":"Πολλαπλότητες:",
        "p6":"1 -> (ακριβώς ένα)",
        "p7":"* -> (μηδέν ή περισσότερα)",
        "p8":"n -> (ακριβώς n)",
        "p9":"0..1 -> (μηδέν ή ένα – η συσχέτιση ειναι προαιρετική)",
        "p10":"n..m -> (από n έως m)",
        "p11":" n, m -> (διακριτοί συνδυασμοί)",
        "p12":"Οι συσχετίσεις μπορούν να έχουν κατεύθυνση, που ονομάζεται πλοηγησιμότητα και αφορά τη δυνατότητα που έχουμε από μία κλάση να ανακτήσουμε αντικείμενα της άλλης σε μία συσχέτιση. Ένα X πάνω σε μια άκρη της γραμμής δηλώνει πως δεν προσφέρεται μετάβαση (navigation) προς τη συγκεκριμένη κατεύθυνση.",
        "p13":"Υπάρχει η δυνατότητα συσχέτισης μιάς κλάσης με τον εαυτό της. Αποτελεί κι αυτή μιά σημασιολογική σύνδεση,μεταξύ όμως αντικειμένων της ίδιας κλάσης.",
        "p14":""
    },
	{
        "description":"Η γενίκευση δηλώνει μια σχέση ανάμεσα σε κάτι γενικό (τη βασική κλάση ή αλλιώς γονέα) και κάτι ειδικό (μιαν υποκλάση ή αλλιώς παιδί της).",
        "id":2,
        "name":"Κληρονομικότητα ή Γενίκευση",
        "image":"3.png",
        "image0":"",
        "image1":"",
        "image2":"chapter3_1.png",
        "image3":"",
        "image4":"",
        "image5":"",
        "image6":"",
        "image7":"",
        "image8":"",
        "image9":"",
        "image10":"",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"",
        "p0":"Σκοπός της είναι η δυνατότητα χρήσης μιας υποκείμενης κλάσης, όταν έχει δηλωθεί μια υπερκείμενη κλάση (δυνατότητα υποκατάστασης) καθώς και η σταδιακή περιγραφή ενός στοιχείου αξιοποιώντας την περιγραφή των προγόνων του (κληρονομικότητα).  ",
        "p1":"Παριστάνεται με μια συνεχή γραμμή με κλειστό βέλος που δείχνει προς τη βασική κλάση.",
        "p2":"Η υποκλάση κληρονομεί τα γνωρίσματα και τις λειτουργίες της υπερκλάσης στην οποία ανήκει, ενώ μπορεί επίσης να έχει και νέες δικές της μεθόδους ή γνωρίσματα.",
        "p3":"Απλή κληρονομικότητα: Κάθε κλάση που συμμετέχει σε σχέση κληρονομικότητας έχει μόνο ένα γονέα.",
        "p4":"Πολλαπλή κληρονομικότητα: Μία κλάση κληρονομεί χαρακτηριστικά από περισσότερες της μίας κλάσεις-γονέα.",
        "p5":"Κληρονομικότητα και γενίκευση αποτελούν τις δύο όψεις ενός μηχανισμού ταξινόμησης οντοτήτων του πραγματικού κόσμου: Η κλάση - παιδί είναι εξειδίκευση της κλάσης - γονέα και η κλάση - γονέας είναι γενίκευση της κλάσης – παιδί. ",
        "p6":"Σημειώστε ότι:",
        "p7":"- Εφόσον η κληρονομικότητα αφορά κλάσεις και όχι αντικείμενα, δεν υπάρχει πολλαπλότητα σε σχέσεις κληρονομικότητας.",
        "p8":"- Η υλοποίηση μιας μεθόδου σε μία υποκείμενη κλάση επικαλύπτει οποιαδήποτε μέθοδο με το ίδιο όνομα σε υπερκείμενες κλάσεις.",
        "p9":"- Μία μέθοδος μπορεί να δηλωθεί σε περισσότερες από μία κλάσεις που συνδέονται με κληρονομικότητα, ενώ μια ιδιότητα όχι.",
        "p10":"",
        "p11":"",
        "p12":"",
        "p13":"",
        "p14":""
    },
	{
        "description":"α. Συναρμολόγηση",
        "id": 3,
        "name":"Συναρμολόγηση και Σύνθεση",
        "image":"4.png",
        "image0":"",
        "image1":"",
        "image2":"chapter4_1.png",
        "image3":"",
        "image4":"",
        "image5":"",
        "image6":"",
        "image7":"",
        "image8":"",
        "image9":"chapter4_2.png",
        "image10":"",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"",
        "p0":"Όταν αντικείμενα μιας κλάσης περιέχουν αντικείμενα κάποιας άλλης κλάσης, τότε προκύπτει σχέση συναρμολόγηγης μεταξύ των δύο κλάσεων. Με άλλα λόγια, η συναρμολόγηση εκφράζει τη σύνθεση συνόλων από απλούστερα μέρη. ",
        "p1":"Συμβολίζεται με ένα λευκό ρόμβο από την πλευρά του όλου.",
        "p2":"Δε θα πρέπει να συγχέεται με την κληρονομικότητα, γιατί στην περίπτωση της συναρμολόγησης δεν αναγνωρίζουμε χαρακτηριστικά που αποδίδονται από μία κλάση σε μία άλλη. ",
        "p3":"Θα μπορούσε να θεωρηθεί ως μια ειδική συσχέτιση χωρίς όμως να συγχέεται με αυτή, μια και η διαφορά των δύο έγγειται στο ότι στη συναρμολόγηση μία κλάση που περιέχεται σε μία άλλη, είναι τμήμα της.",
        "p4":"",
        "p5":"",
        "p6":"β. Σύνθεση",
        "p7":"Η σύνθεση είναι πιο ισχυρή μορφή συναρμολόγησης. Είναι δηλαδή και αυτή μία σχέση όλου – μερών μόνο που τα μέρη θεωρούνται αχώριστα από το όλο. Τα αντικείμενα – μέρη δεν μπορούν να υφίστανται, εάν δεν υφίσταται το όλο, η σύνθετη κλάση δηλαδή στην οποία και περιέχονται. Επίσης, τα αντικείμενα – μέρη θα πρέπει να ανήκουν σε ένα και μόνο ένα αντικείμενο - όλο.",
        "p8":"Συμβολίζεται με ένα μαύρο ρόμβο από την πλευρά του όλου.",
        "p9":"",
        "p10":"",
        "p11":"",
        "p12":"",
        "p13":"",
        "p14":""
      },
      {
          "description":"Πρόκειται για κλάσεις για τις οποίες δεν επιτρέπεται η δημιουργία στιγμιοτύπων. ",
          "id":4,
          "name":"Αφηρημένες κλάσεις",
          "image":"5.png",
          "image0":"",
          "image1":"",
          "image2":"",
          "image3":"",
          "image4":"",
          "image5":"",
          "image6":"",
          "image7":"",
          "image8":"",
          "image9":"",
          "image10":"",
          "image11":"",
          "image12":"",
          "image13":"chapter5_1.png",
          "image14":"",
          "p0":"Χρησιμοποιούνται μόνο για να ορίσουν γενικές έννοιες από τις οποίες εκπορεύονται συγκεκριμένες κλάσεις. Συναντώνται στα ανώτερα επίπεδα των δέντρων κληρονομικότητας και δημιουργούνται με την προσδοκία ότι οι υποκλάσεις τους θα προσθέσουν δομή και συμπεριφορά. ",
          "p1":"Δηλώνονται με τη χρήση της λέξης abstract πριν από τη λέξη class.",
          "p2":"- Κάθε αφηρημένη κλάση διαθέτει τουλάχιστον μία abstract μέθοδο, δηλαδή μέθοδο χωρίς καθόλου σώμα. Οι abstract μέθοδοι χρησιμοποιούνται μόνο ως πρότυπα για την κατασκευή μιας οικογένειας μεθόδων που πρέπει να καλούνται με τον ίδιο τρόπο.",
          "p3":"- Μια αφηρημένη κλάση μπορεί να έχει τις δικές της μεταβλητές και συναρτήσεις.",
          "p4":"- Μια αφηρημένη κλάση μπορεί να έχει υποκλάσεις (μπορεί να γίνει extended).",
          "p5":"- Η απόγονος μιας abstract κλάσης δεν είναι και αυτή abstract, μόνο αν ορίζει τα σώματα όλων των abstract μεθόδων της.",
          "p6":"",
          "p7":"Μία αφηρημένη κλάση που δεν έχει γνωρίσματα και όλες οι μέθοδοί της είναι αφηρημένες και δημόσιες καλείται διεπαφή (interface).",
          "p8":"Οι κλάσεις που κληρονομούν από μία διεπαφή λέγεται ότι την υλοποιούν. Μια αφηρημένη κλάση μπορεί να υλοποιήσει (implement) μια διεπαφή (interface). Αν μια κλάση κάνει implement μια διεπαφή και δεν υλοποιήσει έστω και μία μέθοδο της διεπαφής, τότε η κλάση προσδιορίζεται ως abstract.",
          "p9":"i. Δεν μπορούμε να δημιουργήσουμε αντικείμενα από μία διεπαφή.",
          "p10":"ii. Μία κλάση μπορεί να υλοποιεί περισσότερες από μία διεπαφές.",
          "p11":"iii. Μία κλάση που υλοποιεί μία διεπαφή κληρονομεί όλες τις σταθερές και τις μεθόδους της.",
          "p12":"iv. Μία διεπαφή μπορεί να υλοποιηθεί από οποιαδήποτε κλάση, ακόμα και αν η κλάση αυτή είναι υποκλάση κάποιας άλλης κλάσης.",
          "p13":"",
          "p14":""
      },
  	{
        "description":"Μία κλάση συσχέτισης (association class) αποδίδει ιδιότητες και λειτουργίες σε μία συσχέτιση.",
        "id":5,
        "name":"Κλάσεις συσχετίσεων",
        "image":"6.png",
        "image0":"",
        "image1":"",
        "image2":"",
        "image3":"chapter6_1.png",
        "image4":"",
        "image5":"",
        "image6":"",
        "image7":"",
        "image8":"",
        "image9":"",
        "image10":"",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"",
        "p0":"Ουσιαστικά, δημιουργείται για να διατηρήσουμε πληροφορία που είναι συγκεκριμένη για τη συσχέτιση, αλλά όχι για κάθε μία από τις κλάσεις που συμμετέχουν.",
        "p1":"Μία κλάση συσχέτισης απεικονίζεται ως ένα σύμβολο κλάσης (ορθογώνιο) το οποίο είναι προσκολλημένο μέσω μιας διακεκομμένης γραμμής στη διαδρομή της συσχέτισης. Εϊναι πλήρης κλάση και μπορεί να έχει λειτουργίες, ιδιότητες και συσχετίσεις.",
        "p2":"Μπορεί να υπάρχει το πολύ ένα στιγμιότυπο της κλάσης συσχέτισης μεταξύ οποιουδήποτε ζεύγους συσχετιζόμενων αντικειμένων ανεξάρτητα από πολλαπλότητες και στα δύο άκρα.",
        "p3":"Στα διαγράμματα κλάσεων που εμφανίζονται κλάσεις συσχέτισης υπάρχει δυνατότητα αναπαράστασης της ίδιας κατάστασης χωρίς τη χρήση τέτοιων κλάσεων.",
        "p4":"α. Συσχέτιση πολλά προς πολλά και κλάση συσχέτισης: ",
        "p5":"Διάσπαση της συσχέτισης σε δύο ένα προς πολλά συσχετίσεις και εισαγωγή της κλάσης συσχέτισης ως κανονική κλάση μεταξύ των δύο άλλων.",
        "p6":"β. Ένα προς πολλά συσχέτιση και κλάση συσχέτισης: ",
        "p7":"Ενσωμάτωση των ιδιοτήτων της κλάσης συσχέτισης στην κλάση με πολλαπλότητα πολλά.",
        "p8":"",
        "p9":"",
        "p10":"",
        "p11":"",
        "p12":"",
        "p13":"",
        "p14":""
    },
    {
        "description":"",
        "id":6,
        "name":"Υλοποίηση κλάσεων",
        "image":"7.png",
        "image0":"",
        "image1":"chapter7_1.png",
        "image2":"chapter7_2.png",
        "image3":"chapter7_3.png",
        "image4":"chapter7_4.png",
        "image5":"chapter7_5.png",
        "image6":"chapter7_6.png",
        "image7":"chapter7_7.png",
        "image8":"chapter7_8.png",
        "image9":"chapter7_9.png",
        "image10":"chapter7_10.png",
        "image11":"",
        "image12":"",
        "image13":"",
        "image14":"",
        "p0":"- Κλάση",
        "p1":"- Αφηρημένη Κλάση",
        "p2":"- Διασύνδεση",
        "p3":"- Ιδιότητες και μέθοδοι, προσδιοριστικά ορατότητας, τύποι δεδομένων",
        "p4":"- Στατικές ιδιότητες και μέθοδοι",
        "p5":"- Μονόδρομες συσχετίσεις",
        "p6":"- Αμφίδρομες συσχετίσεις",
        "p7":"- Συσχετίσεις με πολλαπλότητα",
        "p8":"- Συσσωματώσεις και συνθέσεις",
        "p9":"- Κληρονομικότητα",
        "p10":"",
        "p11":"",
        "p12":"",
        "p13":"",
        "p14":""
    }
]

}
